## Pandas Series and DataFrames

# Series
### form of sequentially one-dimensional arrays 
### all elements are one data type
### can be created from lists, tuples and arrays
### unidimensional

In [2]:
import pandas as pd

In [3]:
pd.Series(["M","F","G","M","F",'F'])

0    M
1    F
2    G
3    M
4    F
5    F
dtype: object

In [5]:
import numpy as np

In [6]:
pd.Series(np.array(['M','F','G','M','F','F']))

0    M
1    F
2    G
3    M
4    F
5    F
dtype: object

In [10]:
gen = pd.Series(np.array(['M','F','G','M','F','F']))
type(gen)

pandas.core.series.Series

In [35]:
dic = {'a':1,"b":2,'5':3,4:'d'}
dic_1=pd.Series({'a':1,"b":2,'c':3,4:'d'})
pd.Series(dic),type(dic),type(dic_1)

(a    1
 b    2
 5    3
 4    d
 dtype: object,
 dict,
 pandas.core.series.Series)

In [31]:
dic_1=pd.Series({'a':1,"b":2,'c':3,4:'d'})
pd.Series(dic_1),type(dic_1 )

(a    1
 b    2
 c    3
 4    d
 dtype: object,
 pandas.core.series.Series)

In [23]:
dic_1.index

Index(['a', 'b', 'c', 4], dtype='object')

In [25]:
dic_1.values

array([1, 2, 3, 'd'], dtype=object)

In [39]:
list_1=['2023-17-04','vaish',21,'sep',2002,'girl']
ser=pd.Series(list_1)
ser,ser.index

(0    2023-17-04
 1         vaish
 2            21
 3           sep
 4          2002
 5          girl
 dtype: object,
 RangeIndex(start=0, stop=6, step=1))

In [8]:
pd.DataFrame({'Name':['vaish','prem','srey'],"Age":[21,22,23],'Sex':['male','female','gay']})

    Name  Age     Sex
0  vaish   21    male
1   prem   22  female
2   srey   23     gay

# DataFrame
### two dimensional data structure that can store various types of data
### multidimensional

In [9]:
df=pd.DataFrame({'Name':['srey','prema','vaish'],"Age":[21,22,23],'Gender':['male','female','gay']})
df

    Name  Age  Gender
0   srey   21    male
1  prema   22  female
2  vaish   23     gay

In [10]:
df['Age']

0    21
1    22
2    23
Name: Age, dtype: int64

In [11]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [12]:
df['Age'][2]

23

In [13]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [16]:
ser1=pd.Series(['vaish','prema','srey'],index=[0,1,2])
ser2=pd.Series(['kasula','ganga','gummu'],index=[0,1,2])
ser1,ser2,ser1+ser2

(0    vaish
 1    prema
 2     srey
 dtype: object,
 0    kasula
 1     ganga
 2     gummu
 dtype: object,
 0    vaishkasula
 1     premaganga
 2      sreygummu
 dtype: object)

In [23]:
ser1=pd.Series([1,2,3,2],index=[0,1,2,3])
ser2=pd.Series([2,3,4,5],index=[0,1,2,3])
ser1,ser2,ser1+ser2

(0    1
 1    2
 2    3
 3    2
 dtype: int64,
 0    2
 1    3
 2    4
 3    5
 dtype: int64,
 0    3
 1    5
 2    7
 3    7
 dtype: int64)

In [24]:
ser1.sum()

8

In [25]:
ser2.sum()

14

In [27]:
ser2=pd.Series(['kasula','ganga','gummu'],index=[2,0,1])
ser2.sort_values()

0     ganga
1     gummu
2    kasula
dtype: object

In [28]:
ser3=pd.Series([11,12,13],name='rollno')
plus_10= lambda x:x+10
plus_10(5)

15

In [29]:
ser3.apply(lambda x:x+10)

0    21
1    22
2    23
Name: rollno, dtype: int64

In [30]:
ser3.apply(lambda x:x*10)

0    110
1    120
2    130
Name: rollno, dtype: int64

In [57]:
df=pd.DataFrame([['name','age','gender'],['prem',20,'female'],['sre',21,'female'],['karthik',22,'male']])
df

         0    1       2
0     name  age  gender
1     prem   20  female
2      sre   21  female
3  karthik   22    male

In [71]:
df=pd.DataFrame([['prem',19,'female'],['shesh',20,'male'],['vaish',21,'female']],columns=['name','age','gender'])
df

    name  age  gender
0   prem   19  female
1  shesh   20    male
2  vaish   21  female

In [72]:
df.index=['n1','n2','n3']
df

     name  age  gender
n1   prem   19  female
n2  shesh   20    male
n3  vaish   21  female

In [73]:
df.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [74]:
df.dtypes

name      object
age        int64
gender    object
dtype: object

In [79]:
df.rename(index={"n1":"n_1"})

      name  age  gender
n_1   prem   19  female
n2   shesh   20    male
n3   vaish   21  female

### only changes temp and gives the orginal data without any change

In [81]:
df

     name  age  gender
n1   prem   19  female
n2  shesh   20    male
n3  vaish   21  female

### to make change in orginal data add inplace=true

In [83]:
df.rename(index={"n1":"n_1"},inplace='true')

In [84]:
df

      name  age  gender
n_1   prem   19  female
n2   shesh   20    male
n3   vaish   21  female

In [86]:
scores={"math":[77,80,85],"eng":[75,77,85],"ss":[65,68,95]}
scores

{'math': [77, 80, 85], 'eng': [75, 77, 85], 'ss': [65, 68, 95]}

In [87]:
df=pd.DataFrame(scores,index=['N1','N2','N3'])
df

    math  eng  ss
N1    77   75  65
N2    80   77  68
N3    85   85  95

### can copy the data into other datafraame by[:]

In [88]:
df1=df[:]

In [89]:
df1

    math  eng  ss
N1    77   75  65
N2    80   77  68
N3    85   85  95

In [91]:
df1.drop('N3')

    math  eng  ss
N1    77   75  65
N2    80   77  68

In [92]:
df1

    math  eng  ss
N1    77   75  65
N2    80   77  68
N3    85   85  95

In [98]:
df1.drop('N3',inplace=True)

KeyError: "['N3'] not found in axis"

In [99]:
df1

    math  eng  ss
N1    77   75  65
N2    80   77  68

### to remove columns give it as axis

In [102]:
df1.drop('ss',axis=1)

    math  eng
N1    77   75
N2    80   77

In [103]:
df1.drop(['ss','math'],axis=1)

    eng
N1   75
N2   77

In [104]:
df1.drop(['ss','math'],axis=1,inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_12208\734065710.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop(['ss','math'],axis=1,inplace=True)

In [105]:
df1

    eng
N1   75
N2   77

In [106]:
df

    math  eng  ss
N1    77   75  65
N2    80   77  68
N3    85   85  95

In [109]:
df.loc[['N3','N2']]

    math  eng  ss
N3    85   85  95
N2    80   77  68

In [111]:
df

    math  eng  ss
N1    77   75  65
N2    80   77  68
N3    85   85  95

In [110]:
df.iloc[0,1:]

eng    75
ss     65
Name: N1, dtype: int64

In [112]:
df.iloc[2,2]

95

In [113]:
df.iloc[[0,1],[1,2]]

    eng  ss
N1   75  65
N2   77  68

In [114]:
df['evs']=65

In [115]:
df

    math  eng  ss  evs
N1    77   75  65   65
N2    80   77  68   65
N3    85   85  95   65

In [135]:
df.loc[3]=7
df.loc[4]=70

In [136]:
df

    math  eng  ss  evs
N1    77   75  65   65
N2    80   77  68   65
N3    85   85  95   65
3      7    7   7    7
4     70   70  70   70